import streamlit as st

# ส่วนหัวข้อเว็บ (Title สีฟ้า)
st.title("# :blue[ยินดีต้อนรับสู่ ร้านหมีเบเกอร์ร่า]")

# ส่วนเมนูของทางร้าน (Menu)
st.header("เมนู")
st.write("คุกกี้ 20 บาท")
st.write("เค้กสตอว์เบอร์รี่ 65 บาท")
st.write("ครัวซอง 35 บาท")
st.write("ชาเขียว 50 บาท")
st.write("ชาไทย 50 บาท")
st.write("โกโก้ 50 บาท")


# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
    st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมาก ๆ! 🎉")

#ส่วนที่ 1 กรอกเมนูอาหาร
st.write("กรอกสินค้าที่คุณต้องการ")

#ส่วนที่ 2 สร้างช่องรับเมนูอาหาร และ เครื่องดื่ม
weight = st.text_input("กรอกน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0, value=1.0)
height_cm = st.text_input("กรอกส่วนสูงของคุณ (เซนติเมตร):", min_value=1.0, value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI ▶️"):
    #แปลงส่วนสูงจาก cm เป้น เมตร แล้วคำนวณ BMI
    height_m = height_cm / 100
    bmi = weight / (height_m ** 2)

    st.write("---")
    st.header(f"ค่า BMI ของคุณคือ: **{bmi :.2f}**")

#ส่วนที่ 4 แปลผลค่า BMI ตามเกณฑ์
if bmi < 18.5:
      st.warning("🚨 คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
elif 18.5 <= bmi < 23.0:
      st.success("💪 คุณมีน้ำหนักอยู่ในเกณฑ์ปกติ (สุขภาพดี)")
elif 23.0 <= bmi < 25.0:
      st.info("🔍 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
else:
      st.error("⚠️ คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นางสาวภูณิสรา เตชะสืบ เลขที่ 29 ม.4/10")
